# Homebrew packages for dotfiles install-core.sh
# Install with: brew bundle --file=Brewfile

# Core CLI
brew 'git'
brew 'gh'
brew 'ripgrep'            # required by telescope live_grep/grep_string
brew 'fd'                 # preferred finder for telescope find_files
brew 'tmux'
brew 'starship'
brew 'mise'               # Ruby/Node/Python runtime manager
brew 'zoxide'             # smarter cd (z <dir>); init in .zshrc

# zsh quality-of-life (sourced from .zshrc)
brew 'zsh-autosuggestions'
brew 'zsh-fast-syntax-highlighting'
brew 'zsh-history-substring-search'

# Editor
brew 'neovim'

# Python tooling
brew 'pipx'

# Ruby build dependency — https://stackoverflow.com/q/78817340
brew 'libyaml'

# Java
brew 'openjdk'

# Claude Code QoL
brew 'rtk'

# Casks
cask 'font-fira-code-nerd-font'
cask 'docker-desktop'
cask '1password'
cask 'vlc'
cask 'iterm2'
cask 'caffeine'
cask 'cmux'
cask 'tolaria'
cask 'slack'
