# Homebrew packages for dotfiles install-core.sh
# Install with: brew bundle --file=Brewfile

# Core CLI
brew "git"
brew "gh"
brew "ripgrep"
brew "fd"                 # used by fzf so it respects .gitignore
brew "fzf"
brew "tmux"
brew "fish"
brew "starship"
brew "mise"               # Ruby/Node/Python runtime manager

# Editor
brew "neovim"

# Python tooling
brew "pipx"

# Ruby build dependency — https://stackoverflow.com/q/78817340
brew "libyaml"

# Java
brew "openjdk"

# Claude Code QoL
brew "rtk"

# Casks
cask "font-fira-code-nerd-font"
cask "docker-desktop"
cask "1password"
cask "vlc"
